using System;

namespace GraphArray
{
    class Program
    {
        static void Main(string[] args)
        {
            int num = 7;
            int[,] graph = Graph.newGraph(num);
            //Матрица смежности
            //int[,] graph = new int[7, 7]
            /*{
                {0, 3, 5, 2, 100_000, 100_000, 100_000},
                {3, 0, 4, 7, 100_000,    1,    100_000},
                {5, 4, 0, 6, 100_000, 100_000,    1},
                {2, 7, 6, 0,    9,       2,       3},
                {100_000, 100_000, 100_000, 9, 0, 5, 8},
                {100_000, 1, 100_000, 2, 5, 0, 4},
                {100_000, 100_000, 1, 3, 8, 4, 0},

            };*/

            /*int[,] graph = new int[7, 7]
            {
                 {0, 5, 100_000, 100_000, 100_000, 12, 9},
                 {5, 0, 8, 100_000, 100_000, 100_000, 100_000},
                 {100_000, 8, 0, 2, 8, 100_000, 4},
                 {100_000, 100_000, 2, 0, 7, 100_000, 100_000},
                 {100_000, 100_000, 8, 7, 0, 3, 100_000},
                 {12, 100_000, 100_000, 100_000, 3, 0, 6},
                 {9, 100_000, 4, 100_000, 100_000, 6, 0},

            };*/

            //Выводим матрицу смежности
            for (int i = 0; i < num; i++)
{
    for (int j = 0; j < num; j++)
    {
        Console.Write($"{graph[i, j]} ");
    }
    Console.WriteLine();
}
//Алгорим Дейкстры
Graph.Deykstra(graph);
}
}
}
